### Inconsistent text & typos:

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel(r"D:\Coding\Data-Prep-EDA\Code\Data\Student Grades.xlsx")
df.head()

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [3]:
df.head()

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [4]:
df.isna().sum()

Student    2
Class      3
Year       6
Grade      4
dtype: int64

In [6]:
df.dropna(subset=["Student", "Class"], inplace=True)

In [7]:
df.Grade.fillna(df.Grade.mean(), inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_5236\3132786124.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.Grade.fillna(df.Grade.mean(), inplace=True)

In [8]:
df.Year = np.where(df.Year.isna(), "Freshman", df.Year)

In [9]:
df.head()

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [10]:
df.Class.value_counts()

Class
Intro to Python              25
Intro to SQL                 20
Freshman Seminar             12
Exploratory Data Analysis    12
EDA                          12
Python                        1
Name: count, dtype: int64

In [12]:
df[df.Class.isin(["Exploratory Data Analysis", "EDA"])]

      Student                      Class       Year   Grade
58     Evelyn  Exploratory Data Analysis  Sophomore   89.00
59       Jack  Exploratory Data Analysis  Sophomore   84.00
60       Ella  Exploratory Data Analysis  Sophomore  200.00
61      Chloe  Exploratory Data Analysis  Sophomore   87.00
62     Landon  Exploratory Data Analysis     Junior   85.55
63  Christian  Exploratory Data Analysis     Junior   77.00
64     Jordan  Exploratory Data Analysis     Junior   83.00
65   Jonathan  Exploratory Data Analysis     Junior   82.00
66       Levi  Exploratory Data Analysis     Junior   91.00
67   Victoria  Exploratory Data Analysis     Junior   90.00
68     Aubrey  Exploratory Data Analysis     Junior   83.00
69      Jaxon  Exploratory Data Analysis     Junior   64.00
70     Julian                        EDA     Junior   95.00
71      Grace                        EDA     Junior   77.00
72     Isaiah                        EDA     Junior   88.00
73    Cameron                        EDA     Junior   72.00
74        Eli                        EDA     Junior   92.00
75      Angel                        EDA     Junior   79.00
76       Zoey                        EDA     Junior   91.00
77      Aaron                        EDA     Junior   85.00
78    Charles                        EDA     Junior   93.00
79     Connor                        EDA     Junior   91.00
80      Riley                        EDA     Junior   87.00
84      Gavin                        EDA     Senior   85.55

In [13]:
df[df.Class.isin(["Intro to Python", "Python"])]

      Student            Class      Year  Grade
12  Alexander  Intro to Python  Freshman   85.0
13      Logan  Intro to Python  Freshman   85.0
14      James  Intro to Python  Freshman   82.0
15     Daniel  Intro to Python  Freshman   85.0
16     Elijah  Intro to Python  Freshman   85.0
17   Benjamin  Intro to Python  Freshman   81.0
18        Mia  Intro to Python  Freshman   80.0
19        Mia           Python  Freshman   80.0
20     Jayden  Intro to Python  Freshman   82.0
21      Aiden  Intro to Python  Freshman   86.0
22    Matthew  Intro to Python  Freshman   87.0
23      Emily  Intro to Python  Freshman   78.0
24    Jackson  Intro to Python  Freshman   88.0
25      Lucas  Intro to Python  Freshman   77.0
26      David  Intro to Python  Freshman   74.0
27     Joseph  Intro to Python  Freshman   93.0
28    Abigail  Intro to Python  Freshman   89.0
29      Avery  Intro to Python  Freshman   79.0
30    Anthony  Intro to Python  Freshman   84.0
31      Dylan  Intro to Python  Freshman   84.0
32     Andrew  Intro to Python  Freshman   94.0
33     Carter  Intro to Python  Freshman   95.0
34     Samuel  Intro to Python  Freshman   83.0
35    Gabriel  Intro to Python  Freshman   82.0
36     Joshua  Intro to Python  Freshman   71.0
37       John  Intro to Python  Freshman   50.0

In [14]:
df.Year.value_counts()

Year
Freshman     38
Sophomore    24
Junior       19
Senior        1
Name: count, dtype: int64